Bwooce/ardupilot/libraries/AP_HAL_ESP32/Scheduler.cpp
    // Additional info for watchdog resets - get more details if available
    if (reason == ESP_RST_TASK_WDT || reason == ESP_RST_INT_WDT || reason == ESP_RST_WDT) {
        // Report heap status in case it's memory related
        size_t free_heap = esp_get_free_heap_size();
        size_t min_free_heap = esp_get_minimum_free_heap_size();
        GCS_SEND_TEXT_SAFE(MAV_SEVERITY_WARNING, "Heap: free=%u min=%u",
                     (unsigned)free_heap, (unsigned)min_free_heap);

        // Try to get WDT task name if available
        #if CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0 || CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1
        // Note: ESP-IDF doesn't provide direct API to get which task triggered WDT
        // but we can report that WDT was triggered
        GCS_SEND_TEXT_SAFE(MAV_SEVERITY_WARNING, "WDT: Check console for task details");
        #endif
        
        // Log more details via ESP_LOG which might be captured
        ESP_LOGE("WDT", "Watchdog reset detected - heap free=%u min=%u",
                 (unsigned)free_heap, (unsigned)min_free_heap);
    }

    // Check for stored core dump from previous crash and report via GCS
    esp32_check_and_report_coredump();
}

void Scheduler::init()
{

#ifdef SCHEDDEBUG
    printf("%s:%d \n", __PRETTY_FUNCTION__, __LINE__);
#endif

    // Suppress task_wdt errors during startup - tasks aren't registered yet
    esp_log_level_set("task_wdt", ESP_LOG_NONE);

    // Debug via MAVLink STATUSTEXT - safe from serial contamination
    ESP32_DEBUG_INFO("Starting ESP32 Scheduler initialization");
    ESP32_DEBUG_VERBOSE("Scheduler running with CONFIG_FREERTOS_HZ=%d", CONFIG_FREERTOS_HZ);
    
    // Report ESP32 reset reason via MAVLink
    report_reset_reason();
    
    // Report debug protection status if enabled
#if defined(CONFIG_COMPILER_STACK_CHECK) || defined(CONFIG_HEAP_POISONING_COMPREHENSIVE) || defined(CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK)
    // Build protection flags string
    const char* protections = "ESP32 Debug: "
#ifdef CONFIG_COMPILER_STACK_CHECK
        "STACK "
#endif
#ifdef CONFIG_HEAP_POISONING_COMPREHENSIVE
        "HEAP "
#endif
#ifdef CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK
        "WATCH"
#endif
        ;
    ESP_LOGI("SCHEDULER", "%s", protections);
    GCS_SEND_TEXT_SAFE(MAV_SEVERITY_INFO, "%s", protections);
#endif

    // keep main tasks that need speed on CPU 0
    // pin potentially slow stuff to CPU 1, as we have disabled the WDT on that core.
    #define FASTCPU 0
    #define SLOWCPU 1

    // Create FreeRTOS tasks -- pin main thread and UART to Core 0 (fast),
    // IO/storage/RC to Core 1 (slow, no WDT)
    struct {
        const char *name;
        TaskFunction_t func;
        uint32_t stack;
        UBaseType_t prio;
        TaskHandle_t *handle;
        BaseType_t core;
    } tasks[] = {
        {"APM_MAIN",    _main_thread,    MAIN_SS,    MAIN_PRIO,    &_main_task_handle,    FASTCPU},
        {"APM_TIMER",   _timer_thread,   TIMER_SS,   TIMER_PRIO,   &_timer_task_handle,   FASTCPU},
        {"APM_RCOUT",   _rcout_thread,   RCOUT_SS,   RCOUT_PRIO,   &_rcout_task_handle,   SLOWCPU},
        {"APM_RCIN",    _rcin_thread,    RCIN_SS,    RCIN_PRIO,    &_rcin_task_handle,    SLOWCPU},
        {"APM_UART",    _uart_thread,    UART_SS,    UART_PRIO,    &_uart_task_handle,    FASTCPU},
        {"APM_IO",      _io_thread,      IO_SS,      IO_PRIO,      &_io_task_handle,      SLOWCPU},
        {"APM_STORAGE", _storage_thread, STORAGE_SS, STORAGE_PRIO, &_storage_task_handle, SLOWCPU},
    };

    for (auto &t : tasks) {
        if (xTaskCreatePinnedToCore(t.func, t.name, t.stack, this, t.prio, t.handle, t.core) != pdPASS) {
            ESP_LOGE("SCHEDULER", "FAILED to create task %s on CPU%d", t.name, t.core);
        } else {
            ESP_LOGI("SCHEDULER", "Created %s on CPU%d", t.name, t.core);
        }
    }
}

template <typename T>
void executor(T oui)
{
    oui();
}

void IRAM_ATTR Scheduler::thread_create_trampoline(void *ctx)
{
    AP_HAL::MemberProc *t = (AP_HAL::MemberProc *)ctx;
    (*t)();
    free(t);

    // delete the calling task
    vTaskDelete(NULL);
}

/*
  create a new thread
*/
bool Scheduler::thread_create(AP_HAL::MemberProc proc, const char *name, uint32_t requested_stack_size, priority_base base, int8_t priority)
{
#ifdef SCHEDDEBUG
    printf("%s:%d \n", __PRETTY_FUNCTION__, __LINE__);
#endif

    // take a copy of the MemberProc, it is freed after thread exits
    AP_HAL::MemberProc *tproc = (AP_HAL::MemberProc *)calloc(1, sizeof(proc));
    if (!tproc) {
        return false;
    }
    *tproc = proc;

    uint8_t thread_priority = IO_PRIO;
    static const struct {
        priority_base base;
        uint8_t p;
    } priority_map[] = {
        { PRIORITY_BOOST, IO_PRIO},
        { PRIORITY_MAIN, MAIN_PRIO},
        { PRIORITY_SPI, SPI_PRIORITY},
        { PRIORITY_I2C, I2C_PRIORITY},
        { PRIORITY_CAN, IO_PRIO},
        { PRIORITY_TIMER, TIMER_PRIO},
        { PRIORITY_RCIN, RCIN_PRIO},
        { PRIORITY_IO, IO_PRIO},
        { PRIORITY_UART, UART_PRIO},
        { PRIORITY_NET, WIFI_PRIO1},
        { PRIORITY_STORAGE, STORAGE_PRIO},
        { PRIORITY_SCRIPTING, UART_PRIO},
    };
    for (uint8_t i=0; i<ARRAY_SIZE(priority_map); i++) {
        if (priority_map[i].base == base) {
#ifdef SCHEDDEBUG
            printf("%s:%d \n", __PRETTY_FUNCTION__, __LINE__);
#endif
            thread_priority = constrain_int16(priority_map[i].p + priority, 1, 25);
            break;
        }
    }
    // chibios has a 'thread working area', we just another 1k.
    #define EXTRA_THREAD_SPACE 1024
    uint32_t actual_stack_size = requested_stack_size+EXTRA_THREAD_SPACE;

    tskTaskControlBlock* xhandle;
    BaseType_t xReturned = xTaskCreate(thread_create_trampoline, name, actual_stack_size, tproc, thread_priority, &xhandle);
    if (xReturned != pdPASS) {
        free(tproc);
        return false;
    }

    // Do NOT auto-register dynamic threads with the task watchdog.
    // Core ArduPilot threads (timer, rcout, rcin, io, storage, uart, main)
    // register themselves explicitly via register_task_with_watchdog().
    // Dynamic threads (FTP, scripting, test threads) do not feed the WDT,
    // and registering them would cause spurious WDT resets.

