Bwooce/ardupilot/libraries/AP_HAL_ESP32/Scheduler.cpp
    return true;
}

void IRAM_ATTR Scheduler::delay(uint16_t ms)
{
    uint64_t start = AP_HAL::micros64();
    while ((AP_HAL::micros64() - start)/1000 < ms) {
        delay_microseconds(1000);
        if (_min_delay_cb_ms <= ms) {
            if (in_main_thread()) {
                call_delay_cb();
            }
        }
    }
}

void IRAM_ATTR Scheduler::delay_microseconds(uint16_t us)
{
    if (in_main_thread() && us < 100) {
        esp_rom_delay_us(us);
    } else { // Minimum delay for FreeRTOS is 1ms
        uint32_t tick = portTICK_PERIOD_MS * 1000;

        // For delays >= 1ms, feed the watchdog to prevent timeout.
        // Silently ignore ESP_ERR_NOT_FOUND -- dynamic threads created via
        // thread_create() are intentionally not registered with the WDT.
        if (us >= 1000) {
            esp_task_wdt_reset();
        }

        vTaskDelay((us+tick-1)/tick);
    }
}

void IRAM_ATTR Scheduler::delay_microseconds_boost(uint16_t us)
{
    // For ESP32, boost just means we should try to be more accurate
    // by avoiding task switches when possible
    if (!_priority_boosted) {
        _priority_boosted = true;
        // Could potentially increase task priority here if needed
        // vTaskPrioritySet(NULL, configMAX_PRIORITIES - 1);
    }

    if (us < 100) {
        // For very short delays, use busy wait for accuracy
        esp_rom_delay_us(us);
    } else {
        // For longer delays, use normal delay
        delay_microseconds(us);
    }
}

void Scheduler::boost_end(void)
{
    if (_priority_boosted) {
        _priority_boosted = false;
        // Restore normal priority if we changed it
        // vTaskPrioritySet(NULL, original_priority);
    }
}

void Scheduler::expect_delay_ms(uint32_t ms)
{
    if (ms == 0) {
        // Cancel expected delay
        _expected_delay_duration_ms = 0;
        _expected_delay_start_ms = 0;
    } else {
        _expected_delay_start_ms = AP_HAL::millis();
        _expected_delay_duration_ms = ms;
    }
}

bool Scheduler::in_expected_delay(void) const
{
    if (_expected_delay_duration_ms == 0) {
        return false;
    }

    uint32_t now = AP_HAL::millis();
    return (now - _expected_delay_start_ms) < _expected_delay_duration_ms;
}

void IRAM_ATTR Scheduler::register_timer_process(AP_HAL::MemberProc proc)
{
#ifdef SCHEDDEBUG
    printf("%s:%d \n", __PRETTY_FUNCTION__, __LINE__);
#endif
    for (uint8_t i = 0; i < _num_timer_procs; i++) {
        if (_timer_proc[i] == proc) {
            return;
        }
    }
    if (_num_timer_procs >= ESP32_SCHEDULER_MAX_TIMER_PROCS) {
        printf("Out of timer processes\n");
        return;
    }
    _timer_sem.take_blocking();
    _timer_proc[_num_timer_procs] = proc;
    _num_timer_procs++;
    _timer_sem.give();
}

void IRAM_ATTR Scheduler::register_io_process(AP_HAL::MemberProc proc)
{
#ifdef SCHEDDEBUG
    printf("%s:%d \n", __PRETTY_FUNCTION__, __LINE__);
#endif
    _io_sem.take_blocking();
    for (uint8_t i = 0; i < _num_io_procs; i++) {
        if (_io_proc[i] == proc) {
            _io_sem.give();
            return;
        }
    }
    if (_num_io_procs < ESP32_SCHEDULER_MAX_IO_PROCS) {
        _io_proc[_num_io_procs] = proc;
        _num_io_procs++;
    } else {
        printf("Out of IO processes\n");
    }
    _io_sem.give();
}

void IRAM_ATTR Scheduler::register_timer_failsafe(AP_HAL::Proc failsafe, uint32_t period_us)
{
    _failsafe = failsafe;
}

void Scheduler::reboot(bool hold_in_bootloader)
{
    printf("Restarting now...\n");
    hal.rcout->force_safety_on();
    unmount_sdcard();
    esp_restart();
}

bool IRAM_ATTR Scheduler::in_main_thread() const
{
    return _main_task_handle == xTaskGetCurrentTaskHandle();
}

// disable interrupts and save state for later restoration
void* Scheduler::disable_interrupts_save(void)
{
    // Use FreeRTOS critical section which disables interrupts
    // and returns the interrupt mask to restore later
    return (void*)(uintptr_t)portSET_INTERRUPT_MASK_FROM_ISR();
}

// restore interrupt state from disable_interrupts_save()
void Scheduler::restore_interrupts(void* state)
{
    // Restore the interrupt mask that was saved
    portCLEAR_INTERRUPT_MASK_FROM_ISR((UBaseType_t)(uintptr_t)state);
}

void Scheduler::watchdog_pat()
{
    // Pat the watchdog timer for the current thread
    // This is safe to call from any thread that has been registered with the watchdog
    esp_err_t result = esp_task_wdt_reset();
    if (result != ESP_OK && result != ESP_ERR_NOT_FOUND) {
        // Only log real errors, not "not registered" which is expected for some threads
        ESP_LOGE("WDT", "Failed to pat watchdog: %d", result);
    }
}

void Scheduler::set_system_initialized()
{
#ifdef SCHEDDEBUG
    printf("%s:%d \n", __PRETTY_FUNCTION__, __LINE__);
#endif
    if (_initialized) {
        AP_HAL::panic("PANIC: scheduler::system_initialized called more than once");
    }

    _initialized = true;
}

bool Scheduler::is_system_initialized()
{
    return _initialized;
}

void IRAM_ATTR Scheduler::_timer_thread(void *arg)
{
#ifdef SCHEDDEBUG
    printf("%s:%d start\n", __PRETTY_FUNCTION__, __LINE__);
#endif
    Scheduler *sched = (Scheduler *)arg;

    // Register this task with watchdog
    register_task_with_watchdog("APM_TIMER");

#if HAL_INS_DEFAULT != HAL_INS_NONE
    // wait to ensure INS system inits unless using HAL_INS_NONE
    while (!_initialized) {
        sched->delay_microseconds(1000);
    }
#endif

#ifdef SCHEDDEBUG
    printf("%s:%d initialised\n", __PRETTY_FUNCTION__, __LINE__);
#endif
    while (true) {
        sched->delay_microseconds(1000);
        sched->_run_timers();
        //analog in
#ifndef HAL_DISABLE_ADC_DRIVER
        ((AnalogIn*)hal.analogin)->_timer_tick();
#endif
    }
}

void IRAM_ATTR Scheduler::_rcout_thread(void* arg)
{
    Scheduler *sched = (Scheduler *)arg;

    // Register this task with watchdog
    register_task_with_watchdog("APM_RCOUT");

    while (!_initialized) {
        sched->delay_microseconds(1000);
    }

    while (true) {
        sched->delay_microseconds(4000);
        // process any pending RC output requests
        hal.rcout->timer_tick();
    }
}

void IRAM_ATTR Scheduler::_run_timers()
{
#ifdef SCHEDULERDEBUG
    printf("%s:%d start \n", __PRETTY_FUNCTION__, __LINE__);
#endif
    if (_in_timer_proc) {
        return;
    }
#ifdef SCHEDULERDEBUG
    printf("%s:%d _in_timer_proc \n", __PRETTY_FUNCTION__, __LINE__);
#endif
    _in_timer_proc = true;

    int num_procs = 0;

    _timer_sem.take_blocking();
    num_procs = _num_timer_procs;
    _timer_sem.give();

    // now call the timer based drivers
    for (int i = 0; i < num_procs; i++) {
        if (_timer_proc[i]) {
            _timer_proc[i]();
        }
    }

