Bwooce/ardupilot/libraries/AP_HAL_ESP32/Scheduler.cpp
    // and the failsafe, if one is setup
    if (_failsafe != nullptr) {
        _failsafe();
    }

    _in_timer_proc = false;
}

void IRAM_ATTR Scheduler::_rcin_thread(void *arg)
{
    Scheduler *sched = (Scheduler *)arg;

    // Register this task with watchdog
    register_task_with_watchdog("APM_RCIN");

    while (!_initialized) {
        sched->delay_microseconds(20000);
    }
    hal.rcin->init();
    while (true) {
        sched->delay_microseconds(1000);
        ((RCInput *)hal.rcin)->_timer_tick();
    }
}

void IRAM_ATTR Scheduler::_run_io(void)
{
#ifdef SCHEDULERDEBUG
    printf("%s:%d start \n", __PRETTY_FUNCTION__, __LINE__);
#endif
    if (_in_io_proc) {
        return;
    }
#ifdef SCHEDULERDEBUG
    printf("%s:%d initialised \n", __PRETTY_FUNCTION__, __LINE__);
#endif
    _in_io_proc = true;

    int num_procs = 0;
    _io_sem.take_blocking();
    num_procs = _num_io_procs;
    _io_sem.give();
    // now call the IO based drivers
    for (int i = 0; i < num_procs; i++) {
        if (_io_proc[i]) {
            _io_proc[i]();
        }
    }
    _in_io_proc = false;
}

void IRAM_ATTR Scheduler::_io_thread(void* arg)
{
#ifdef SCHEDDEBUG
    printf("%s:%d start \n", __PRETTY_FUNCTION__, __LINE__);
#endif
    // Register this task with watchdog
    register_task_with_watchdog("APM_IO");

    mount_sdcard();
    Scheduler *sched = (Scheduler *)arg;
    while (!sched->_initialized) {
        sched->delay_microseconds(1000);
    }
#ifdef SCHEDDEBUG
    printf("%s:%d initialised \n", __PRETTY_FUNCTION__, __LINE__);
#endif
    uint32_t last_sd_start_ms = AP_HAL::millis();
    while (true) {
        sched->delay_microseconds(1000);
        // run registered IO processes
        sched->_run_io();

        if (!hal.util->get_soft_armed()) {
            // if sdcard hasn't mounted then retry it every 3s in the IO
            // thread when disarmed
            uint32_t now = AP_HAL::millis();
            if (now - last_sd_start_ms > 3000) {
                last_sd_start_ms = now;
                sdcard_retry();
            }
        }
    }
}


void Scheduler::_storage_thread(void* arg)
{
#ifdef SCHEDDEBUG
    printf("%s:%d start \n", __PRETTY_FUNCTION__, __LINE__);
#endif
    Scheduler *sched = (Scheduler *)arg;

    // Register this task with watchdog
    register_task_with_watchdog("APM_STORAGE");
    while (!sched->_initialized) {
        sched->delay_microseconds(10000);
    }
#ifdef SCHEDDEBUG
    printf("%s:%d initialised \n", __PRETTY_FUNCTION__, __LINE__);
#endif
    while (true) {
        sched->delay_microseconds(1000);
        // process any pending storage writes
        hal.storage->_timer_tick();
        //print_profile();
    }
}

void Scheduler::_print_profile(void* arg)
{
    Scheduler *sched = (Scheduler *)arg;
    while (!sched->_initialized) {
        sched->delay_microseconds(10000);
    }

    while (true) {
        sched->delay(10000);
        print_profile();
    }

}

void IRAM_ATTR Scheduler::_uart_thread(void *arg)
{
#ifdef SCHEDDEBUG
    printf("%s:%d start \n", __PRETTY_FUNCTION__, __LINE__);
#endif
    Scheduler *sched = (Scheduler *)arg;

    // Register this task with watchdog
    register_task_with_watchdog("APM_UART");
    while (!sched->_initialized) {
        sched->delay_microseconds(2000);
    }
#ifdef SCHEDDEBUG
    printf("%s:%d initialised\n", __PRETTY_FUNCTION__, __LINE__);
#endif
    while (true) {
        sched->delay_microseconds(1000);
        for (uint8_t i=0; i<hal.num_serial; i++) {
            hal.serial(i)->_timer_tick();
        }
        hal.console->_timer_tick();
    }
}


// get the active main loop rate
uint16_t IRAM_ATTR Scheduler::get_loop_rate_hz(void)
{
    if (_active_loop_rate_hz == 0) {
        _active_loop_rate_hz = _loop_rate_hz;
    }
    return _active_loop_rate_hz;
}

// once every 60 seconds, print some stats...
void Scheduler::print_stats(void)
{
    static int64_t last_run = 0;
    if (AP_HAL::millis64() - last_run > 60000) {
        char buffer[1024];
        vTaskGetRunTimeStats(buffer);
        printf("\n\n%s\n", buffer);
        heap_caps_print_heap_info(0);
        last_run = AP_HAL::millis64();
    }

    // printf("loop_rate_hz: %d",get_loop_rate_hz());
}

#ifdef SCHEDDEBUG
// Print ESP32-specific CPU load info every 60 seconds
void Scheduler::print_esp32_cpu_stats(void)
{
    static int64_t last_run = 0;
    if (AP_HAL::millis64() - last_run < 60000) {
        return;
    }
    last_run = AP_HAL::millis64();

    // Get per-core idle task statistics
    TaskHandle_t idle0_handle = xTaskGetIdleTaskHandleForCore(0);
    TaskHandle_t idle1_handle = xTaskGetIdleTaskHandleForCore(1);

    TaskStatus_t idle0_stats, idle1_stats;
    vTaskGetInfo(idle0_handle, &idle0_stats, pdTRUE, eRunning);
    vTaskGetInfo(idle1_handle, &idle1_stats, pdTRUE, eRunning);

    // Get total runtime (in microseconds)
    static uint64_t last_total_runtime = 0;
    static uint32_t last_idle0_runtime = 0;
    static uint32_t last_idle1_runtime = 0;

    uint64_t total_runtime = esp_timer_get_time();
    uint64_t runtime_delta = total_runtime - last_total_runtime;

    // Calculate CPU load per core (100 - idle%)
    uint8_t core0_load = 0;
    uint8_t core1_load = 0;

    if (last_total_runtime > 0 && runtime_delta > 0) {
        uint32_t idle0_delta = idle0_stats.ulRunTimeCounter - last_idle0_runtime;
        uint32_t idle1_delta = idle1_stats.ulRunTimeCounter - last_idle1_runtime;

        // Convert to percentage (runtime is in ticks, need to scale)
        // FreeRTOS runtime counter is in tick periods (typically 1ms)
        core0_load = 100 - ((idle0_delta * 100ULL * portTICK_PERIOD_MS * 1000) / runtime_delta);
        core1_load = 100 - ((idle1_delta * 100ULL * portTICK_PERIOD_MS * 1000) / runtime_delta);

        // Clamp to valid range
        if (core0_load > 100) core0_load = 100;
        if (core1_load > 100) core1_load = 100;
    }

    last_total_runtime = total_runtime;
    last_idle0_runtime = idle0_stats.ulRunTimeCounter;
    last_idle1_runtime = idle1_stats.ulRunTimeCounter;

    // Get heap stats
    uint32_t heap_free = esp_get_free_heap_size();
    uint32_t heap_min = esp_get_minimum_free_heap_size();

