Bwooce/ardupilot/libraries/AP_HAL_ESP32/Scheduler.cpp
    // Get main loop rate
    uint16_t loop_rate = get_filtered_loop_rate_hz();

    // Log summary
    ESP_LOGI("ESP32_CPU", "=== ESP32 CPU Status ===");
    ESP_LOGI("ESP32_CPU", "Core 0: %d%% | Core 1: %d%%", core0_load, core1_load);
    ESP_LOGI("ESP32_CPU", "Heap: %lu bytes free (%lu min)",
             (unsigned long)heap_free, (unsigned long)heap_min);
    ESP_LOGI("ESP32_CPU", "Main loop: %u Hz", (unsigned)loop_rate);

    // Get per-task CPU usage (top tasks only)
    const UBaseType_t max_tasks = 20;
    TaskStatus_t task_status[max_tasks];
    uint32_t total_run_time;

    UBaseType_t task_count = uxTaskGetSystemState(task_status, max_tasks, &total_run_time);

    if (task_count > 0 && total_run_time > 0) {
        // Sort by runtime (simple bubble sort for top 5)
        for (UBaseType_t i = 0; i < task_count - 1 && i < 5; i++) {
            for (UBaseType_t j = i + 1; j < task_count; j++) {
                if (task_status[j].ulRunTimeCounter > task_status[i].ulRunTimeCounter) {
                    TaskStatus_t temp = task_status[i];
                    task_status[i] = task_status[j];
                    task_status[j] = temp;
                }
            }
        }

        // Log top 5 tasks by CPU usage
        ESP_LOGI("ESP32_CPU", "Top tasks by CPU:");
        for (UBaseType_t i = 0; i < task_count && i < 5; i++) {
            uint32_t task_percent = (task_status[i].ulRunTimeCounter * 100ULL) / total_run_time;
            BaseType_t core = xTaskGetCoreID(task_status[i].xHandle);
            const char* core_str = (core == 0) ? "C0" : (core == 1) ? "C1" : "Any";

            ESP_LOGI("ESP32_CPU", "  %s: %lu%% (prio=%d, stack=%u, core=%s)",
                     task_status[i].pcTaskName,
                     (unsigned long)task_percent,
                     (int)task_status[i].uxCurrentPriority,
                     (unsigned)task_status[i].usStackHighWaterMark,
                     core_str);
        }
    }

    ESP_LOGI("ESP32_CPU", "========================");
}
#endif // SCHEDDEBUG

// Run every 30s (was 10s - increased for mLRS compatibility)
void Scheduler::print_main_loop_rate(void)
{
    static int64_t last_run = 0;
    if (AP_HAL::millis64() - last_run > 30000) {  // Changed from 10000 to 30000 for mLRS
        last_run = AP_HAL::millis64();
        
        // Reset WDT before potentially blocking console write
        esp_task_wdt_reset();

        // AP_Scheduler singleton may not exist (e.g. in examples)
        auto *scheduler = AP_Scheduler::get_singleton();
        if (scheduler == nullptr) {
            return;
        }
        const float actual_loop_rate = scheduler->get_filtered_loop_rate_hz();
        const uint16_t expected_loop_rate = scheduler->get_loop_rate_hz();

        // Use GCS instead of console to avoid blocking
        GCS_SEND_TEXT_SAFE(MAV_SEVERITY_INFO, "Loop rate: %.1fHz / %uHz",
                     actual_loop_rate, expected_loop_rate);
        
        // Don't use console->printf as it might block on UART
        // hal.console->printf("loop_rate: actual: %fHz, expected: %uHz\n", actual_loop_rate, expected_loop_rate);
        
        // Reset WDT after the operation
        esp_task_wdt_reset();
    }
}

void IRAM_ATTR Scheduler::_main_thread(void *arg)
{
    ESP_LOGI("MAIN", "ArduPilot main thread starting");
    Scheduler *sched = (Scheduler *)arg;

    if (sched->callbacks == nullptr) {
        ESP_LOGE("MAIN", "callbacks is NULL - cannot proceed");
        vTaskDelete(NULL);
        return;
    }

#ifndef HAL_DISABLE_ADC_DRIVER
    hal.analogin->init();
#endif
    hal.rcout->init();

    // Register main thread with watchdog BEFORE calling setup()
    register_task_with_watchdog("APM_MAIN");

    ESP_LOGI("MAIN", "Calling setup()");

    // Temporarily increase watchdog timeout for long-running setup()
    // setup() can take 10-15 seconds for parameter loading, CAN init, sensor detection, etc.
    // Normal timeout is 5s, increase to 20s during init
    esp_task_wdt_config_t temp_config = {
        .timeout_ms = 20000,  // 20 seconds for setup
        .idle_core_mask = 0,  // Don't monitor idle tasks; ArduPilot threads register explicitly
        .trigger_panic = true
    };
    esp_task_wdt_reconfigure(&temp_config);
    esp_task_wdt_reset();

    sched->callbacks->setup();
    ESP_LOGI("MAIN", "setup() completed");

    // Restore normal watchdog timeout (5 seconds for production, 30s for debug)
    #ifdef SCHEDDEBUG
    uint32_t normal_timeout_ms = 30000;
    #else
    uint32_t normal_timeout_ms = 5000;
    #endif
    esp_task_wdt_config_t normal_config = {
        .timeout_ms = normal_timeout_ms,
        .idle_core_mask = 0,  // Don't monitor idle tasks; ArduPilot threads register explicitly
        .trigger_panic = true
    };
    esp_task_wdt_reconfigure(&normal_config);
    esp_task_wdt_reset();

    // Re-apply ESP-IDF log levels after parameter loading in setup()
    ESP32::esp32_params()->update_log_levels();

    // Re-enable task_wdt logging to catch real issues
    esp_log_level_set("task_wdt", ESP_LOG_WARN);

    sched->set_system_initialized();

#ifdef SCHEDDEBUG
    printf("%s:%d initialised\n", __PRETTY_FUNCTION__, __LINE__);
#endif
    static uint32_t max_loop_time = 0;  // Track max loop time across all iterations
    
    while (true) {
        // Reset WDT BEFORE running the loop to ensure we don't timeout
        static uint32_t wdt_reset_count = 0;
        static uint32_t last_wdt_reset_report = 0;
        esp_err_t wdt_err = esp_task_wdt_reset();
        if (wdt_err != ESP_OK) {
            GCS_SEND_TEXT_SAFE(MAV_SEVERITY_CRITICAL, "WDT: Reset failed err=%d at %lu ms", 
                         (int)wdt_err, (unsigned long)AP_HAL::millis());
            ESP_LOGE("WDT", "Failed to reset WDT: error %d", wdt_err);
        } else {
            wdt_reset_count++;
            // Report WDT reset success periodically
            uint32_t now = AP_HAL::millis();
            if (now - last_wdt_reset_report > 10000) {
                last_wdt_reset_report = now;
                // Suppress this message - it's just counting successful WDT feeds, not actual resets
                // GCS_SEND_TEXT_SAFE(MAV_SEVERITY_INFO, "WDT: %lu resets OK", 
                //              (unsigned long)wdt_reset_count);
                wdt_reset_count = 0;
            }
        }
        
        // Track loop timing for debugging
        static uint32_t last_loop_start = 0;
        uint32_t loop_start = AP_HAL::millis();
        uint32_t time_since_last = loop_start - last_loop_start;
        
        // Warn if too much time passed since last loop (indicates blocking)
        if (last_loop_start != 0 && time_since_last > 2000) {
            GCS_SEND_TEXT_SAFE(MAV_SEVERITY_CRITICAL, "WDT: %lums since last loop!", 
                         (unsigned long)time_since_last);
        }
        last_loop_start = loop_start;
        
        sched->callbacks->loop();
        
        uint32_t loop_time = AP_HAL::millis() - loop_start;
        if (loop_time > max_loop_time) {
            max_loop_time = loop_time;
            if (loop_time > 2000) {  // Warn if loop takes > 2 seconds
                GCS_SEND_TEXT_SAFE(MAV_SEVERITY_CRITICAL, "WDT: Loop took %lums (max %lums)", 
                             (unsigned long)loop_time, (unsigned long)max_loop_time);
            }
        }
        
        sched->delay_microseconds(250);

        // run stats periodically
#ifdef SCHEDDEBUG
        sched->print_stats();
        sched->print_esp32_cpu_stats();
#endif
        sched->print_main_loop_rate();
        
